In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.3004821 ,  0.16147545,  0.18858324],
       [-0.33678892,  0.0432555 ,  0.91340869],
       [ 0.27501465,  1.64987553, -0.30196493],
       [ 0.47401973, -1.33659515,  1.79410449]])

In [6]:
data_frame = pd.DataFrame(data)

In [7]:
data_frame

          0         1         2
0  0.300482  0.161475  0.188583
1 -0.336789  0.043255  0.913409
2  0.275015  1.649876 -0.301965
3  0.474020 -1.336595  1.794104

In [8]:
type(data_frame)

pandas.core.frame.DataFrame

In [9]:
type(data_frame[0])

pandas.core.series.Series

In [10]:
new_df = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns = ["Salary","Age","Seniority"])

In [11]:
new_df

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [12]:
new_df["Age"]

Atil      0.161475
Zeynep    0.043255
Atlas     1.649876
Mehmet   -1.336595
Name: Age, dtype: float64

In [13]:
new_df["Salary"]

Atil      0.300482
Zeynep   -0.336789
Atlas     0.275015
Mehmet    0.474020
Name: Salary, dtype: float64

In [14]:
new_df[["Salary","Age"]]

          Salary       Age
Atil    0.300482  0.161475
Zeynep -0.336789  0.043255
Atlas   0.275015  1.649876
Mehmet  0.474020 -1.336595

In [16]:
new_df.loc["Atil"]

Salary       0.300482
Age          0.161475
Seniority    0.188583
Name: Atil, dtype: float64

In [17]:
new_df.iloc[0]

Salary       0.300482
Age          0.161475
Seniority    0.188583
Name: Atil, dtype: float64

In [18]:
new_df.iloc[1]

Salary      -0.336789
Age          0.043255
Seniority    0.913409
Name: Zeynep, dtype: float64

In [19]:
new_df

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [20]:
new_df["Extra"] = 10

In [21]:
new_df

          Salary       Age  Seniority  Extra
Atil    0.300482  0.161475   0.188583     10
Zeynep -0.336789  0.043255   0.913409     10
Atlas   0.275015  1.649876  -0.301965     10
Mehmet  0.474020 -1.336595   1.794104     10

In [22]:
new_df.drop("Extra", axis = 1)

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [23]:
new_df

          Salary       Age  Seniority  Extra
Atil    0.300482  0.161475   0.188583     10
Zeynep -0.336789  0.043255   0.913409     10
Atlas   0.275015  1.649876  -0.301965     10
Mehmet  0.474020 -1.336595   1.794104     10

In [24]:
new_df.drop("Extra", axis=1, inplace=True)

In [25]:
new_df

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [26]:
new_df.drop("Mehmet", axis=0)

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965

In [27]:
new_df

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [28]:
new_df.loc["Atlas"]

Salary       0.275015
Age          1.649876
Seniority   -0.301965
Name: Atlas, dtype: float64

In [29]:
new_df.loc["Atlas"]["Salary"]

0.2750146502922042

In [30]:
new_df.loc["Atlas","Salary"]

0.2750146502922042

In [31]:
new_df

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [32]:
boolean_frame = new_df > 0

In [33]:
boolean_frame

        Salary    Age  Seniority
Atil      True   True       True
Zeynep   False   True       True
Atlas     True   True      False
Mehmet    True  False       True

In [34]:
new_df[boolean_frame]

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep       NaN  0.043255   0.913409
Atlas   0.275015  1.649876        NaN
Mehmet  0.474020       NaN   1.794104

In [35]:
new_df[new_df > 0]

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep       NaN  0.043255   0.913409
Atlas   0.275015  1.649876        NaN
Mehmet  0.474020       NaN   1.794104

In [36]:
new_df[new_df["Salary"] > 0.3]

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Mehmet  0.474020 -1.336595   1.794104

In [37]:
new_df[new_df["Age"] > 0.5]

         Salary       Age  Seniority
Atlas  0.275015  1.649876  -0.301965

In [38]:
new_df

          Salary       Age  Seniority
Atil    0.300482  0.161475   0.188583
Zeynep -0.336789  0.043255   0.913409
Atlas   0.275015  1.649876  -0.301965
Mehmet  0.474020 -1.336595   1.794104

In [39]:
new_df.reset_index()

    index    Salary       Age  Seniority
0    Atil  0.300482  0.161475   0.188583
1  Zeynep -0.336789  0.043255   0.913409
2   Atlas  0.275015  1.649876  -0.301965
3  Mehmet  0.474020 -1.336595   1.794104

In [40]:
new_indices = ["Ati", "Zey", "Atl", "Meh"]

In [41]:
new_df["NewIndex"] = new_indices

In [42]:
new_df

          Salary       Age  Seniority NewIndex
Atil    0.300482  0.161475   0.188583      Ati
Zeynep -0.336789  0.043255   0.913409      Zey
Atlas   0.275015  1.649876  -0.301965      Atl
Mehmet  0.474020 -1.336595   1.794104      Meh

In [43]:
new_df.set_index("NewIndex", inplace=True)

In [44]:
new_df

            Salary       Age  Seniority
NewIndex
Ati       0.300482  0.161475   0.188583
Zey      -0.336789  0.043255   0.913409
Atl       0.275015  1.649876  -0.301965
Meh       0.474020 -1.336595   1.794104

In [45]:
new_df.loc["Ati"]

Salary       0.300482
Age          0.161475
Seniority    0.188583
Name: Ati, dtype: float64

In [46]:
# multi index

In [47]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [48]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [49]:
zipped_index = list(zip(first_index, inner_index))

In [50]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [51]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [52]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [56]:
sample_values = np.ones((6,2))

In [57]:
sample_values

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [58]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns=["Age", "Salary"])

In [59]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [60]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [61]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [62]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64